Repository: adielBm/wc-paybox-payment-gateway
Catalog: lang/woo-paybox-payment-gateway-*.po
Languages: he_il

source: Setting
he_il: הגדרות

source: Paybox Payment
he_il: תשלום Paybox

source: Payment Gateway for Paybox by Israel Discount Bank. Orders are marked as "on-hold" when received.
he_il: תשלום באפליקציית Paybox של בנק דיסקונט. הזמנות יסומנו במצב ממתין לתשלום (on-hold).

source: Enable/Disable
he_il: אפשר / בטל

source: Enable Paybox Payment
he_il: אפשר תשלום Paybox

source: Title
he_il: כותרת

source: This controls the title for the payment method the customer sees during checkout.
he_il: זה משפיע על הכותרת של שיטת התשלום שהלקוח יראה בעמוד התשלום.

source: Description
he_il: תיאור

source: Payment method description that the customer will see on your checkout.
he_il: תיאור שיטת התשלום שהלקוח יראה בעמוד התשלום.

source: Instructions
he_il: הוראות

source: Instructions that will be added to the thank you page and emails.
he_il: הוראות לתשלום שיתווספו לעמוד התודה ולאימיילים.

source: Please forward a Paybox payment, use an order number in the Note field when making payment.
he_il: נא העבר תשלום Paybox, השתמש במספר ההזמנה כהערה בעת ביצוע התשלום.

source: Receiver Phone Number
he_il: מספר טלפון לקבלת התשלום

source: Payments are sent to this number.
he_il: התשלום ישלח למספר זה.

source: Paybox App Link
he_il: לינק לאפליקציית Paybox

source: A link to the paybox app, which will appear on the thank you page. (The link can be found in the paybox app). The link looks like this: https://payboxapp.page.link/
he_il: לינק שיפתח ללקוח את אפליקציית Paybox במכשיר הטלפון שלו. הלינק יופיע בעמוד התודה. (את הלינק ניתן למצוא באפליקציה). זה נראה כמו זה: https://payboxapp.page.link/

source: Phone Number:
he_il: מספר טלפון:

source: Click here to go to the paybox app
he_il: לחץ כאן לעבור לתשלום Paybox

source: Awaiting Paybox payment
he_il: ממתין לתשלום Paybox

source: Payment Gateway for Paybox on Woocommerce
he_il: תשלום Paybox ל Woocommerce

source: Payment Gateway Plugin for Paybox by Israel Discount Bank.
he_il: תשלום Paybox.
